[
{"title": "Trade setup for June 9: Top 15 things to know before the opening bell", "link": "https://www.moneycontrol.com/news/business/markets/trade-setup-for-june-9-top-15-things-to-know-before-the-opening-bell-13104451.html", "date": null, "description": "According to experts, the levels to watch are 25,200–25,300 on the higher side, while support is seen at the 24,800–24,700 zones, followed by 24,500 as a key support for the Nifty 50.", "source": "Money Control"},
{"title": "Man arrested for bomb hoax on two trains", "link": "https://www.moneycontrol.com/news/india/man-arrested-for-bomb-hoax-on-two-trains-13104454.html", "date": null, "description": "The accused, identified as Rajesh Shukla, had falsely claimed over phone that bombs had been planted in Kashi Express and Kamayani Express trains, causing an alarm", "source": "Money Control"},
{"title": "Tata Steel aims to commission UK electric arc furnace project by 2027", "link": "https://www.moneycontrol.com/news/business/tata-steel-aims-to-commission-uk-electric-arc-furnace-project-by-2027-13104455.html", "date": null, "description": "Speaking further on the UK plan, the officials said the structural transition is also accompanied by a significant focus on cost rationalisation as the company plans to bring down its fixed costs further from 762 million pounds in FY25 to 540 million pounds in the coming year.", "source": "Money Control"},
{"title": "India-China relations to be 'better and better' in future, direct flights to hopefully resume soon: Ambassador Feihong", "link": "https://www.moneycontrol.com/news/india/india-china-relations-to-be-better-and-better-in-future-direct-flights-to-hopefully-resume-soon-ambassador-feihong-13104453.html", "date": null, "description": "Chinese ambassador Xu Feihong said PM Modi and President XI Jinping had made a \"very important consensus to together promote good neighbourly relationships between China and India\".", "source": "Money Control"},
{"title": "Kareena Kapoor, Saif Ali Khan, Janhvi Kapoor and more celebs arrive at Sonam Kapoor's birthday party", "link": "https://www.moneycontrol.com/entertainment/kareena-kapoor-saif-ali-khan-janhvi-kapoor-and-more-celebs-arrive-at-sonam-kapoor-s-birthday-party-article-13104443.html", "date": null, "description": "Several celebrities, including Kareena Kapoor, Saif Ali Khan, Karisma Kapoor and Janhvi Kapoor spotted outside Sonam Kapoor’s residence for her 39th birthday party.", "source": "Money Control"},
{"title": "Haryana reports 12 new Covid cases: Gurugram sees 10 fresh cases, 2 reported from Faridabad", "link": "https://www.moneycontrol.com/news/india/haryana-reports-12-new-covid-cases-gurugram-sees-10-fresh-cases-2-reported-from-faridabad-13104449.html", "date": null, "description": "Covid cases: Haryana Health Minister Arti Singh Rao urged health officials and the public to remain vigilant and proactive.", "source": "Money Control"},
{"title": "29-year-old Indian techie dies during scuba diving session in Dubai", "link": "https://www.moneycontrol.com/news/india/29-year-old-indian-techie-dies-during-scuba-diving-session-in-dubai-13104445.html", "date": null, "description": "Issac was enjoying Eid-Al-Adha holidays in Dubai with his wife, Resham and younger brother, Ivin, when tragedy struck.", "source": "Money Control"},
{"title": "Tanzania crash kills at least 28", "link": "https://www.moneycontrol.com/world/tanzania-crash-kills-at-least-28-article-13104444.html", "date": null, "description": "One of the vehicles struck in the accident late Saturday, a minibus, was hurled into a river in the country's southwest, near the border with Zambia, said local police", "source": "Money Control"},
{"title": "Smriti Irani and Amar Upadhyay spotted outside Ekta Kapoor’s house ahead of Kyunki Saas Bhi Kabhi Bahu Thi 2 shoot", "link": "https://www.moneycontrol.com/entertainment/smriti-irani-and-amar-upadhyay-spotted-outside-ekta-kapoor-s-house-ahead-of-kyunki-saas-bhi-kabhi-bahu-thi-2-shoot-article-13104440.html", "date": null, "description": "Fans have been eagerly waiting for an update on Kyunki Saas Bhi Kabhi Bahu Thi 2. Smriti Irani and Amar Upadhyay spotted at Ekta Kapoor's house.", "source": "Money Control"},
{"title": "NCLAT rejects Byju's resolution professional's petition in Aakash shareholding row", "link": "https://www.moneycontrol.com/news/business/nclat-rejects-byju-s-resolution-professional-s-petition-in-aakash-shareholding-row-13104438.html", "date": null, "description": "A two-member NCLAT bench said that since the NCLT order is \"consensual\" an an interlocutory order", "source": "Money Control"},
{"title": "NYT Mini Crossword: Clues and answers for June 8, 2025", "link": "https://www.moneycontrol.com/technology/nyt-mini-crossword-clues-and-answers-for-june-8-2025-article-13104433.html", "date": null, "description": "The puzzle for Sunday, June 8, 2025, continues the tradition of providing a delightful test of vocabulary and logic. With clues spanning topics from musical instruments to historic landmarks, this edition promises to engage players of all skill levels. Below is a comprehensive breakdown of the puzzle, including clues, answers, and gameplay tips.", "source": "Money Control"},
{"title": "Russia says pushing offensive into Ukraine's Dnipropetrovsk region", "link": "https://www.moneycontrol.com/world/russia-says-pushing-offensive-into-ukraine-s-dnipropetrovsk-region-article-13104432.html", "date": null, "description": "Ukraine's top political and military leaders did not immediately respond to the claim, which would be a symbolic and strategic blow to Ukraine's forces after months of battlefield setbacks", "source": "Money Control"},
{"title": "Primary Market Action: Investors to see 4 IPOs with 1 listing next week", "link": "https://www.moneycontrol.com/news/business/ipo/primary-market-action-investors-to-see-4-ipos-with-1-listing-next-week-13104410.html", "date": null, "description": "Meanwhile, bathroom accessories maker Ganga Bath Fittings will be the only listing scheduled next week. Investors can start trading in company's shares on the NSE Emerge effective June 11.", "source": "Money Control"},
{"title": "Apple WWDC 2025 on June 9: 5 big things Apple is expected to announce tomorrow", "link": "https://www.moneycontrol.com/technology/apple-wwdc-2025-on-june-9-5-big-things-apple-is-expected-to-announce-tomorrow-article-13104430.html", "date": null, "description": "Apple is taking a slightly different route this time. Instead of focusing heavily on artificial intelligence, Apple is expected to talk more about new designs, useful tools, and small improvements to how its devices work.", "source": "Money Control"},
{"title": "Dalal Street Week Ahead: US, India inflation, US-India trade talks among 10 key factors to focus on", "link": "https://www.moneycontrol.com/news/business/markets/dalal-street-week-ahead-us-india-inflation-us-india-trade-talks-among-10-key-factors-to-focus-on-13104403.html", "date": null, "description": "The coming week (starting from June 9) is expected to maintain positive bias supported by the RBI move and optimism with respect to India-US trade deal talks. However, unexpected shifts in US tariffs and ongoing geopolitical tensions may bring some volatility to the market, according to experts.", "source": "Money Control"},
{"title": "Chintan Shivir 2.0: Ministers to learn, reflect, and share experiences —A unique initiative in Chhattisgarh", "link": "https://www.moneycontrol.com/news/india/chintan-shivir-2-0-ministers-to-learn-reflect-and-share-experiences-a-unique-initiative-in-chhattisgarh-13104428.html", "date": null, "description": "The two-day retreat, held under the leadership of Chief Minister Vishnu Deo Sai, is exclusively designed for ministers to reflect on their journey of the past one and a half years", "source": "Money Control"},
{"title": "'Venkatesh Iyer would have had great IPL 2025 if he played for RCB': Coach Andy Flower", "link": "https://www.moneycontrol.com/sports/cricket/ipl/venkatesh-iyer-would-have-had-great-ipl-2025-if-he-played-for-rcb-coach-andy-flower-article-13104414.html", "date": null, "description": "It would be interesting to see if KKR continue to show faith on Venkatesh Iyer or release him heading into the next edition.", "source": "Money Control"},
{"title": "Convert your photos into GTA VI-style portraits or wallpapers using ChatGPT, Gemini, and other AI tools: A step-by-step guide", "link": "https://www.moneycontrol.com/technology/convert-your-photos-into-gta-vi-style-portrait-or-wallpaper-using-chatgpt-gemini-and-other-ai-tools-a-step-by-step-guide-article-13104415.html", "date": null, "description": "Here’s a detailed, step-by-step guide on how to do it, along with important tips and precautions.", "source": "Money Control"},
{"title": "Operation Sindoor: Pakistan's lies about strikes on Adampur airbase called out by satellite images - Check pictures", "link": "https://www.moneycontrol.com/news/india/operation-sindoor-pakistan-s-lies-about-strikes-on-adampur-airbase-called-out-by-satellite-images-check-pictures-13104404.html", "date": null, "description": "Damien Symon debunked Pak's claims as Islamabad showed a doctored photo as an evidence in support of its claim, showing an aircraft positioned next to what it claimed was blast damage.", "source": "Money Control"},
{"title": "Akalis reduced SGPC to 'Shiromani Golak' committee: Punjab CM Mann", "link": "https://www.moneycontrol.com/news/india/akalis-reduced-sgpc-to-shiromani-golak-committee-punjab-cm-mann-13104416.html", "date": null, "description": "Mann alleged that the Badals \"misused\" their political power to interfere in religious affairs, including \"manipulating the appointment of Jathedars of the Akal Takht to suit their personal interests\"", "source": "Money Control"},
{"title": "IAF to get Rs 10,000 crore indigenous I-STAR spy planes for precision strikes: Report", "link": "https://www.moneycontrol.com/news/india/indian-air-force-to-get-rs-10-000-crore-three-indigenous-i-star-spy-planes-for-precision-strikes-report-13104406.html", "date": null, "description": "The ISTAR provides air-to-ground surveillance to the forces to help them in carrying out precision strikes.", "source": "Money Control"},
{"title": "How long a personal loan default affects your credit report — and how to recover from it", "link": "https://www.moneycontrol.com/news/business/personal-finance/how-long-a-personal-loan-default-affects-your-credit-report-and-how-to-recover-from-it-13104412.html", "date": null, "description": "A personal loan default can hurt your credit score for years to come. Here's the length of time the effect lasts and what you can do.", "source": "Money Control"},
{"title": "Blistering heat sweeps Haryana, Punjab; Sirsa hottest at 45.8 degree Celsius", "link": "https://www.moneycontrol.com/news/trends/weather/blistering-heat-sweeps-haryana-punjab-sirsa-hottest-at-45-8-degree-celsius-13104407.html", "date": null, "description": "While Sirsa in Haryana reeled under severe heat, most other places in the state also recorded above normal maximum temperatures", "source": "Money Control"},
{"title": "Ayushman Vay Vandana card: Free health insurance of Rs 5 lakh for citizens aged 70 years & above", "link": "https://www.moneycontrol.com/news/business/personal-finance/ayushman-vay-vandana-card-free-health-insurance-of-rs-5-lakh-for-citizens-who-aged-70-years-above-13104405.html", "date": null, "description": "The government's latest move under Ayushman Bharat Pradhan Mantri Jan Arogya Yojana (AB PM-JAY) promises big-time healthcare protection for India's elderly.", "source": "Money Control"},
{"title": "Kapil Sharma jams with Aamir Khan, hugs Sitaare Zameen Par cast at Aamir Khan's house, writes \"They give me a memory for a lifetime\"", "link": "https://www.moneycontrol.com/entertainment/kapil-sharma-jams-with-aamir-khan-hugs-sitaare-zameen-par-cast-at-aamir-khan-s-house-writes-they-give-me-a-memory-for-a-lifetime-article-13104379.html", "date": null, "description": "Kapil Sharma shared a video with Sitaare Zameen Par debutant actors, which special needs, excitedly meeting him. The actor attended musical night at Aamir Khan's house.", "source": "Money Control"},
{"title": "Donald Trump News Live: Fact-check examines claim Donald Trump's past pardons wiped $1.3bn in debt", "link": "https://www.moneycontrol.com/world/us-president-donald-trump-news-trump-tariffs-policy-decision-updates-08-06-2025-alpha-liveblog-13104401.html", "date": null, "description": "Welcome to our live blog tracking the latest developments from US President Donald Trump's second term in office. Get real-time updates on Trump's policy decisions, legislative actions, headline-grabbing statements and various other developments impacting the US and the world.", "source": "Money Control"},
{"title": "DRDO lab transfers technologies of nine systems to 10 industry partners", "link": "https://www.moneycontrol.com/news/business/drdo-lab-transfers-technologies-of-nine-systems-to-10-industry-partners-13104400.html", "date": null, "description": "The technologies transferred to the industry include Chemical, Biological, Radiological, Nuclear (CBRN) Recce Vehicle (Tracked) Mk-II (Bharat Electronics Limited); Mounted Gun System (Bharat Forge Limited); and Anti-Terrorist Vehicle - Tracked Version (Metaltech Motor Bodies Private Limited).", "source": "Money Control"},
{"title": "Sonakshi Sinha's husband Zaheer Iqbal mocks her as she fell ill, writes \"This girl has gone VIRAL\"", "link": "https://www.moneycontrol.com/entertainment/sonakshi-sinha-s-husband-zaheer-iqbal-mocks-her-as-she-fell-ill-writes-this-girl-has-gone-viral-article-13104398.html", "date": null, "description": "Sonakshi Sinha seems slightly irritated, hiding under the towel, but soon she's smiling and joining in on the playful vibe of her husband, Zaheer Iqbal, in the viral video. Watch here", "source": "Money Control"},
{"title": "In 2026, NDA will form governments in Tamil Nadu, West Bengal: Amit Shah", "link": "https://www.moneycontrol.com/news/india/in-2026-nda-will-form-governments-in-tamil-nadu-west-bengal-amit-shah-13104394.html", "date": null, "description": "Union Home Minister also dared Stalin to explain if he has fulfilled all of DMK's 2021 poll assurances.", "source": "Money Control"},
{"title": "Diljit Dosanjh shares BTS photos from Sardaar Ji 3 set, hints at teaser release", "link": "https://www.moneycontrol.com/entertainment/diljit-dosanjh-shares-bts-photos-from-sardaar-ji-3-set-hints-at-teaser-release-article-13104361.html", "date": null, "description": "Directed by Amar Hundal, Diljit Dosanjh starrer Sardaar Ji 3 is expected to return to its horror-romcom roots from the first instalment. Neeru Bajwa, Gulshan Grover and more celebs are part of the film.", "source": "Money Control"},
{"title": "Iran claims without evidence that it took Israeli nuclear files", "link": "https://www.moneycontrol.com/world/iran-claims-without-evidence-that-it-took-israeli-nuclear-files-article-13104391.html", "date": null, "description": "The remarks by Esmail Khatib follow Iranian state television claiming on Saturday that their intelligence officials seized documents, again without any evidence.", "source": "Money Control"},
{"title": "Former Pakistan PM Imran Khan likely to be released on June 11: Report", "link": "https://www.moneycontrol.com/world/former-pakistan-pm-imran-khan-likely-to-be-released-on-june-11-report-article-13104390.html", "date": null, "description": "Earlier last month, Imran Khan had said he will lead his party’s upcoming protest movement against the Pakistan Muslim League-Nawaz (PML-N) led coalition government", "source": "Money Control"},
{"title": "Sanjay Manjrekar throws Virat-Rohit's SENA stats to explain why 'Kohli is in a different league'", "link": "https://www.moneycontrol.com/sports/cricket/sanjay-manjrekar-throws-virat-rohit-s-sena-stats-to-explain-why-kohli-is-in-a-different-league-article-13104388.html", "date": null, "description": "Reflecting on the notion of fans clubbing Rohit Sharma and Virat Kohli in the same bracket, Sanjay Manjrekar made it clear why the duo don't belong together, at least in Test cricket.", "source": "Money Control"},
{"title": "Israel says to block Gaza-bound aid boat carrying Greta Thunberg", "link": "https://www.moneycontrol.com/world/israel-says-to-block-gaza-bound-aid-boat-carrying-greta-thunberg-article-13104386.html", "date": null, "description": "The Madleen, operated by the Freedom Flotilla Coalition, left Italy on June 1 with the aim of delivering aid and challenging the Israeli blockade,", "source": "Money Control"},
{"title": "Rhea Chakraborty on her career struggles after Sushant Singh Rajput death case, says \"I stopped getting any acting work\"", "link": "https://www.moneycontrol.com/entertainment/rhea-chakraborty-on-her-career-struggles-after-sushant-singh-rajput-death-case-says-i-stopped-getting-any-acting-work-article-13104385.html", "date": null, "description": "Rhea Chakraborty recalled the time when she and her brother, Showik Chakraborty, were arrested by the Narcotics Control Bureau (NCB) in a drugs-related investigation linked to Sushant Singh Rajput's death in 2020.", "source": "Money Control"},
{"title": "New CPI series to track online shopping in 12 cities; weights to be finalised within two months", "link": "https://www.moneycontrol.com/news/business/economy/new-cpi-series-to-track-online-shopping-in-12-cities-weights-to-be-finalised-within-two-months-13104381.html", "date": null, "description": "The new index, replacing the decade-old inflation measure, is expected to launch in Q1 FY26", "source": "Money Control"},
{"title": "Amit Shah apologises for not knowing Tamil in Madurai, calls it 'one of the greatest languages' [Watch]", "link": "https://www.moneycontrol.com/news/india/amit-shah-apologises-for-not-knowing-tamil-in-madurai-calls-it-one-of-the-greatest-languages-watch-13104380.html", "date": null, "description": "Shah's comments over the language come amid a language war that has been going on with the MK Stalin's DMK government in the southern state, who accused the Centre of Hindi imposition by way of the proposed three-language formula as part of the National Education Policy (NEP).", "source": "Money Control"},
{"title": "Sridhar Vembu on AI, jobs and the future economy: ‘It’s not a tech problem, it’s political economy’", "link": "https://www.moneycontrol.com/news/trends/sridhar-vembu-on-ai-jobs-and-the-future-economy-it-s-not-a-tech-problem-it-s-political-economy-13104384.html", "date": null, "description": "A key part of addressing it, he argued, is for governments to break up monopolies—especially in tech.", "source": "Money Control"},
{"title": "'Dhool chehre pe thi, aap aina saaf karte rahe': Devendra  Fadnavis jibes at Rahul Gandhi on allegations against EC", "link": "https://www.moneycontrol.com/news/india/dhool-chehre-pe-thi-aap-aina-saaf-karte-rahe-devendra-fadnavis-jibes-at-rahul-gandhi-on-allegations-against-ec-13104378.html", "date": null, "description": "Devendra  Fadnavis said the defeat in Maharashtra has hurt Gandhi and his allies. People of Maharashtra will not forgive Gandhi if he continues to insult their mandate, the CM added.", "source": "Money Control"},
{"title": "Aamir Khan says Sitaare Zameen Par won't steam on OTT, says, \"I believe in theatres\"", "link": "https://www.moneycontrol.com/entertainment/aamir-khan-says-sitaare-zameen-par-won-t-steam-on-ott-says-i-believe-in-theatres-article-13104376.html", "date": null, "description": "Aamir Khan is all set for his much-awaited film Sitaare Zameen Par, but he has recently confirmed in an interview that the movie won’t be available on streaming services anytime soon.", "source": "Money Control"},
{"title": "AP EAMCET Results 2025 OUT @ cets.apsche.ap.gov.in, direct link here", "link": "https://www.moneycontrol.com/education/ap-eamcet-result-2025-releasing-today-cets-apsche-ap-gov-in-direct-link-here-article-13104335.html", "date": null, "description": "The Andhra Pradesh State Council of Higher Education (APSCHE) has announced the AP Engineering, Agriculture, and Pharmacy Common Entrance Test (EAMCET) 2025 results today, June 8.", "source": "Money Control"},
{"title": "'Won't apologise for standing up for patient denied care': Goa minister on firing health official", "link": "https://www.moneycontrol.com/news/india/won-t-apologise-for-standing-up-for-patient-denied-care-goa-minister-on-firing-health-official-13104370.html", "date": null, "description": "Chief Medical Officer of GMCH, Dr Rudresh Kurtikar, was fired publicly, and he was later suspended on Rane’s orders after he “lost his cool\" during his surprise visit to the hospital.", "source": "Money Control"},
{"title": "Anupam Kher climbs a wall to reach Prabhas' film set, netizens call it a \"legend stuff\": Watch", "link": "https://www.moneycontrol.com/entertainment/anupam-kher-climbs-a-wall-to-reach-prabhas-film-set-netizens-call-it-a-legend-stuff-watch-article-13104363.html", "date": null, "description": "Veteran actor Anupam Kher recently transformed an ordinary workday into an unexpected adventure while filming his upcoming project with Prabhas in Hyderabad. Sharing the amusing experience with fans, the 70-year-old star posted a humorous video on Saturday, offering a glimpse into his chaotic yet entertaining journey to reach the film set.", "source": "Money Control"},
{"title": "AP EAPCET Toppers 2025: Anirudh Reddy tops Engineering stream - Complete list here", "link": "https://www.moneycontrol.com/education/ap-eapcet-toppers-2025-anirudh-reddy-tops-engineering-stream-complete-list-here-article-13104354.html", "date": null, "description": "AP EAPCET 2025 Toppers List announced! Check top rankers in Engineering, Agriculture & Pharmacy streams, results, and counselling updates.", "source": "Money Control"},
{"title": "Housefull 5 box office collection: The Akshay Kumar starrer comedy-drama earns over Rs 50 crore in 2 days", "link": "https://www.moneycontrol.com/entertainment/housefull-5-box-office-collection-the-akshay-kumar-starrer-comedy-drama-earns-over-rs-50-crore-in-2-days-article-13104353.html", "date": null, "description": "The Akshay Kumar, Riteish Deshmukh, and Jacqueline Fernandez starrer Housefull 5 has crossed the ₹50 crore nett mark at the domestic box office within just two days of its release.", "source": "Money Control"},
{"title": "After Rahul Gandhi, now Tejashwi makes sharp attack on ECI; says 'We were winning but...'", "link": "https://www.moneycontrol.com/news/india/after-rahul-gandhi-now-tejashwi-makes-sharp-attack-on-eci-says-we-were-winning-but-13104358.html", "date": null, "description": "Tejashwi's sharp barb comes one day after Congress leader Rahul Gandhi, in an op-ed in The Indian Express, alleged that unfair means were used during the counting of election results for the Maharashtra Assembly Elections of 2024.", "source": "Money Control"},
{"title": "Tahira Kashyap shares a glimpse into her week as she heals from her breast cancer relapse", "link": "https://www.moneycontrol.com/entertainment/tahira-kashyap-shares-a-glimpse-into-her-week-as-she-heals-from-her-breast-cancer-relapse-article-13104350.html", "date": null, "description": "Author and filmmaker Tahira Kashyap shared a photo of sunset, videos of the garden showcasing the beauty of nature and a pic of herself posing with flowers. She also urges to slowdown.", "source": "Money Control"},
{"title": "‘For Bihar and its people’: Chirag Paswan declares he will contest Bihar assembly polls", "link": "https://www.moneycontrol.com/news/india/for-bihar-and-its-people-chirag-paswan-declares-he-will-contest-bihar-assembly-polls-13104348.html", "date": null, "description": "I will contest the assembly polls in Bihar. I will contest not just in Bihar but for Bihar and its people, said Chirag Paswan", "source": "Money Control"},
{"title": "AP EAMCET 2025 Results, Rank Card Released; 1.89 Lakh Students Qualified in Engineering Stream", "link": "https://www.moneycontrol.com/education/ap-eamcet-2025-results-rank-card-released-1-89-lakh-students-qualified-in-engineering-stream-article-13104342.html", "date": null, "description": "The Andhra Pradesh State Council of Higher Education (APSCHE) has announced the results of the AP Engineering, Agriculture, and Pharmacy Common Entrance Test (EAMCET) 2025 today, June 8.", "source": "Money Control"},
{"title": "Airtel MD writes to banks, NPCI, RBI to join forces against digital frauds; moots collaborative measures", "link": "https://www.moneycontrol.com/news/business/airtel-md-writes-to-banks-npci-rbi-to-join-forces-against-digital-frauds-moots-collaborative-measures-13104355.html", "date": null, "description": "The Sunil Mittal-led telco has also done a similar outreach with major banks, including SBI, HDFC and others, sources said.", "source": "Money Control"},
{"title": "Netflix CEO Ted Sarandos opens up about Sacred Games slow growth in India, director Anurag Kashyap says \"He should have started with Saas Bahu\"", "link": "https://www.moneycontrol.com/entertainment/netflix-ceo-ted-sarandos-opens-up-about-sacred-games-slow-growth-in-india-director-anurag-kashyap-calls-it-dumb-article-13104344.html", "date": null, "description": "During a recent conversation on Nikhil Kamath’s podcast, Netflix Co-CEO Ted Sarandos reflected on the platform’s early foray into Indian content, citing Sacred Games as a defining project that marked its debut in the country’s entertainment landscape.", "source": "Money Control"},
{"title": "Ozempic side effect: Male users reveal change to their genitals after injection", "link": "https://www.moneycontrol.com/news/trends/ozempic-side-effect-male-users-reveal-shocking-change-to-their-genitals-after-injection-13104339.html", "date": null, "description": "Men using the weight-loss drug claim to be experiencing 'Ozempic penis' phenomenon, sparking debate on online forums.", "source": "Money Control"},
{"title": "'Under whose pressure was permission given': BJP demands resignation of CM Siddaramaiah, DK Shivakumar over Bengaluru stampede", "link": "https://www.moneycontrol.com/news/india/under-whose-pressure-was-permission-given-bjp-demands-resignation-of-cm-siddaramaiah-dk-shivakumar-over-bengaluru-stampede-13104320.html", "date": null, "description": "Karnataka Assembly Leader of Opposition (LoP) R Ashok strongly criticised the Siddaramaiah-led government over the tragedy and demanded the resignation of Chief Minister Siddaramaiah and Deputy Chief Minister DK Shivakumar.", "source": "Money Control"},
{"title": "Goa CM Pramod Sawant assures no suspension for Dr Rudresh Kuttikar amid medical college row", "link": "https://www.moneycontrol.com/news/india/goa-cm-pramod-sawant-assures-no-suspension-for-dr-rudresh-kuttikar-amid-medical-college-row-13104333.html", "date": null, "description": "Rane said he took the action after receiving a complaint from a senior journalist who pointed out that his mother-in-law was mistreated by the doctor in the casualty ward of the Goa Medical College and Hospital", "source": "Money Control"},
{"title": "Is Mumbai auto driver's Rs 8 lakh/month hustle VC fundable? Sanjeev Bikhchandani responds", "link": "https://www.moneycontrol.com/news/trends/is-mumbai-auto-driver-s-rs-8-lakh-month-hustle-vc-fundable-sanjeev-bikhchandani-responds-13104259.html", "date": null, "description": "Info Edge founder Sanjeev Bikhchandani weighs in on a Mumbai auto driver's viral side hustle, debating if the bag-storage 'goldmine' is truly venture capital fundable.", "source": "Money Control"},
{"title": "Delhi stares at intense heatwave as temperature to go up to 44 degrees in next few days; yellow alert issued", "link": "https://www.moneycontrol.com/news/india/delhi-stares-at-intense-heatwave-as-temperature-to-go-up-to-44-degrees-in-next-few-days-yellow-alert-issued-13104330.html", "date": null, "description": "IMD has said that the high temperature in the national capital will be coupled with high humidity, adding to the sticky heat. On top of that, the nights are also going to be hot and uncomfortable.", "source": "Money Control"},
{"title": "Priyanka Chopra, Nick Jonas, and Malti Enjoy a dreamy New York stroll; mom-daughter bond over fake nails: see pics", "link": "https://www.moneycontrol.com/entertainment/priyanka-chopra-nick-jonas-and-malti-enjoy-a-dreamy-new-york-stroll-mom-daughter-bond-over-fake-nails-see-pics-article-13104282.html", "date": null, "description": "Priyanka Chopra gave fans a peek into her recent New York trip, sharing a series of adorable moments with husband Nick Jonas and their daughter Malti Marie through heartwarming photos.", "source": "Money Control"},
{"title": "Maharashtra FYJC 2025 admission schedule revised, final merit list on June 11", "link": "https://www.moneycontrol.com/education/maharashtra-fyjc-2025-admission-schedule-revised-final-merit-list-on-june-11-article-13104325.html", "date": null, "description": "Maharashtra FYJC 2025 admission schedule revised! Final merit list to be released on June 11, 2025. Check important dates, steps to download the merit list, and latest updates here.", "source": "Money Control"},
{"title": "ChatGPT o3 achieves AIR 4 in JEE Advanced mock test, IIT Kharagpur engineer reveals", "link": "https://www.moneycontrol.com/technology/chatgpt-o3-scores-air-4-in-jee-advanced-mock-test-finds-iit-kharagpur-engineer-article-13104327.html", "date": null, "description": "A few years ago, GPT-4 attempted a similar test and didn’t do well, it would have landed somewhere in the 10,000s. This time, the improvement is massive. Anushka admits she thought ChatGPT would struggle. Instead, it soared.", "source": "Money Control"},
{"title": "Thug Life Box Office Collection Day 3: Mani Ratnam and Kamal Haasan's gangster drama earn Rs 30.15 crore", "link": "https://www.moneycontrol.com/entertainment/thug-life-box-office-collection-day-3-mani-ratnam-and-kamal-haasan-s-gangster-drama-earn-rs-30-15-crore-article-13104313.html", "date": null, "description": "Mani Ratnam and Kamal Haasan's Thug Life’s box office collection seems to hold steady after the massive dip the film registered on Friday. The film faces stiff competition from Housefull 5.", "source": "Money Control"},
{"title": "'Municipal taps contaminated, streets turned into rivers of blood': BJP slams Bengal CM Mamata Banerjee", "link": "https://www.moneycontrol.com/news/india/municipal-taps-contaminated-streets-turned-into-rivers-of-blood-bjp-slams-bengal-cm-mamata-banerjee-13104322.html", "date": null, "description": "Sharing visuals, Majumbdar claimed that after \"a particular religious festival was celebrated yesterday\", the streets are red, and even the water flowing from municipal taps is reportedly \"mixed with blood\".", "source": "Money Control"},
{"title": "Donald Trump News Live: President Trump's 2026 budget proposal targets NASA science missions for cuts", "link": "https://www.moneycontrol.com/world/us-president-donald-trump-news-trump-tariffs-policy-decision-updates-07-06-2025-alpha-liveblog-13104069.html", "date": null, "description": "Welcome to our live blog tracking the latest developments from US President Donald Trump's second term in office. Get real-time updates on Trump's policy decisions, legislative actions, headline-grabbing statements and various other developments impacting the US and the world.", "source": "Money Control"},
{"title": "Australia News Live: Data broker practices under scrutiny in Australia following 2025 election spam", "link": "https://www.moneycontrol.com/world/australia-breaking-news-live-updates-08-06-2025-alpha-liveblog-13104121.html", "date": null, "description": "Welcome to our live blog tracking the latest news and developments from Australia. Stay updated with real-time insights into the country's economy, politics, civic issues, and security situation. From political developments and economic trends to environmental concerns and social movements, find comprehensive coverage of the events shaping Australia's landscape.", "source": "Money Control"},
{"title": "Russia Ukraine News Live: Russia awaits Ukraine's confirmation on dead fighter exchange, claims advance in Dnipropetrovsk region", "link": "https://www.moneycontrol.com/world/russia-ukraine-news-live-updates-08-06-2025-alpha-liveblog-13104131.html", "date": null, "description": "Welcome to our live blog tracking the latest news from Russia Ukraine. Get real-time updates on Russia-Ukraine war, policy decisions, legislative actions, headline-grabbing statements and various other developments happening in the both countries.", "source": "Money Control"},
{"title": "NYT Connections hints and answers today for June 8, 2025 (Puzzle #728)", "link": "https://www.moneycontrol.com/technology/nyt-connections-hints-and-answers-today-for-june-8-2025-puzzle-728-article-13104431.html", "date": null, "description": "The June 8, 2025, puzzle (#728) proved to be particularly intriguing, featuring a mix of themes that tested players’ linguistic and reasoning skills. This article provides a comprehensive breakdown of the puzzle, including hints, answers, gameplay tips, and strategies for mastering future puzzles", "source": "Money Control"},
{"title": "Gaza News Live: Hundreds plan 'Global March to Gaza' at Egypt's Rafah border", "link": "https://www.moneycontrol.com/world/gaza-breaking-news-live-updates-08-06-2025-alpha-liveblog-13104144.html", "date": null, "description": "Welcome to our live blog tracking the latest news and developments from Gaza. Stay updated with real-time insights into the region's humanitarian situation, political developments, and security updates. From humanitarian aid and reconstruction efforts to political negotiations and regional dynamics, find comprehensive coverage of the events shaping Gaza's landscape.", "source": "Money Control"},
{"title": "US trade team extends India stay as talks progress ahead of July deadline", "link": "https://www.moneycontrol.com/news/india/us-trade-team-extends-india-stay-as-talks-progress-ahead-of-july-deadline-13104324.html", "date": null, "description": "The team, which was initially scheduled to hold talks with Indian officials on June 5-6, will now be staying till Tuesday to continue discussions", "source": "Money Control"},
{"title": "Major 26 listed realty firms sell Rs 1.62 lakh crore properties in FY25, Godrej Properties tops list", "link": "https://www.moneycontrol.com/news/business/real-estate/major-26-listed-realty-firms-sell-rs-1-62-lakh-crore-properties-in-fy25-godrej-properties-tops-list-13104321.html", "date": null, "description": "In terms of annual sales bookings, Godrej Properties emerged as the largest listed player during last fiscal with pre-sales of Rs 29,444 crore.", "source": "Money Control"},
{"title": "Middle East News Live: UAE expatriates keep homeland Eid traditions alive through food, gatherings, and charity", "link": "https://www.moneycontrol.com/world/middle-east-breaking-news-live-updates-08-06-2025-alpha-liveblog-13104122.html", "date": null, "description": "Welcome to our live blog tracking the latest news and developments from the Middle East. Stay updated with real-time insights into the region's political developments, economic trends, and security situation. From diplomatic relations and economic initiatives to regional conflicts and social movements, find comprehensive coverage of the events shaping the Middle East's landscape.", "source": "Money Control"},
{"title": "Miley Cyrus was not allowed to sing 'Hannah Montana' songs: \"It was still sad knowing...\"", "link": "https://www.moneycontrol.com/entertainment/miley-cyrus-was-not-allowed-to-sing-hannah-montana-songs-it-was-still-sad-knowing-article-13104318.html", "date": null, "description": "Miley Cyrus recently revealed she wasn’t allowed to perform Hannah Montana songs after leaving Disney, despite the show's massive success. The restriction came as a surprise, given her iconic association with the beloved character.", "source": "Money Control"},
{"title": "Rinku Singh engagement: Priya Saroj gets emotional after exchanging rings with India star; watch video and pics", "link": "https://www.moneycontrol.com/sports/cricket/rinku-singh-engagement-priya-saroj-gets-emotional-after-exchanging-rings-with-india-star-watch-video-and-pics-article-13104309.html", "date": null, "description": "Earlier, it was reported the couple will get married on November 18 in Varanasi.", "source": "Money Control"},
{"title": "Telangana Cabinet expansion: 3 Congress MLAs G Vivek Venkata Swamy, Adluri Laxman Kumar, Vakiti Srihari sworn-in as ministers", "link": "https://www.moneycontrol.com/news/india/telangana-cabinet-expansion-3-congress-mlas-g-vivek-venkata-swamy-adluri-laxman-kumar-vakiti-srihari-sworn-in-as-ministers-13104294.html", "date": null, "description": "Telangana CM Revanth Reddy congratulated Vivek Venkata Swamy, Adluri Lakshman and Vakiti Srihari, who are poised to assume ministerial responsibilities in the state government.", "source": "Money Control"},
{"title": "India can add 300 more turboprop aircraft in next 10 years: ATR official", "link": "https://www.moneycontrol.com/news/business/india-can-add-300-more-turboprop-aircraft-in-next-10-years-atr-official-13104300.html", "date": null, "description": "ATR has sold 1,800 aircraft to 200 operators spread across 100 countries.", "source": "Money Control"},
{"title": "Prince Narula slams Elvish Yadav after trolls target his daughter Ekleen and parents, calls him 'Chhapri'", "link": "https://www.moneycontrol.com/entertainment/prince-narula-slams-elvish-yadav-after-trolls-target-his-daughter-ekleen-and-parents-calls-him-chhapri-article-13104308.html", "date": null, "description": "Prince Narula opens up about on his dramatic fight with Elvish Yadav. He reveals that YouTuber still holds grudges against him.", "source": "Money Control"},
{"title": "Tourist guide offers fresh clue in Sonam-Raja Raghuvanshi case: 'Four men were...'", "link": "https://www.moneycontrol.com/news/india/tourist-guide-offers-fresh-clue-in-sonam-raja-raghuvanshi-case-four-men-were-13104305.html", "date": null, "description": "He also confirmed to the local police that on May 22, he had offered to take the couple to Nongriat but they had instead hired another guide named Bha Wansai.", "source": "Money Control"},
{"title": null, "link": null, "date": "Login", "description": null, "source": "Money Control"},
{"title": null, "link": null, "date": "Sign-Up", "description": null, "source": "Money Control"},
{"title": null, "link": null, "date": "English", "description": null, "source": "Money Control"},
{"title": null, "link": null, "date": "MC Login User Name", "description": null, "source": "Money Control"},
{"title": null, "link": null, "date": "English", "description": null, "source": "Money Control"},
{"title": null, "link": null, "date": "PRO", "description": null, "source": "Money Control"},
{"title": null, "link": null, "date": null, "description": null, "source": "Money Control"},
{"title": null, "link": null, "date": null, "description": null, "source": "Money Control"},
{"title": null, "link": null, "date": null, "description": null, "source": "Money Control"},
{"title": null, "link": null, "date": null, "description": null, "source": "Money Control"},
{"title": null, "link": null, "date": null, "description": null, "source": "Money Control"},
{"title": null, "link": null, "date": null, "description": null, "source": "Money Control"},
{"title": null, "link": null, "date": null, "description": null, "source": "Money Control"},
{"title": null, "link": null, "date": "Trending", "description": null, "source": "Money Control"},
{"title": "'Worse than Covid': China expert warns of deadly bioweapon risk after fungal smuggling bust in US", "link": "https://www.moneycontrol.com/world/worse-than-covid-china-expert-warns-of-deadly-bioweapon-risk-after-fungal-smuggling-bust-in-us-article-13104306.html", "date": null, "description": "Investigators revealed that the couple had previously studied the fungus in China, raising alarms over potential biosecurity breaches.", "source": "Money Control"},
{"title": "Diljit Dosanjh and Diana Penty's simulated comedy Detective Sherdil poster and release date OUT, details inside", "link": "https://www.moneycontrol.com/entertainment/diljit-dosanjh-and-diana-penty-s-simulated-comedy-detective-sherdil-poster-and-release-date-out-details-inside-article-13104303.html", "date": null, "description": "Produced by Ali Abbas Zafar, Detective Sherdil features Diljit Dosanjh as detective and Diana Penty as female lead in the upcoming simulated comedy. The makers drops a new poster of the film.", "source": "Money Control"},
{"title": "'...Shreyas Iyer has an attitude': Shashank Singh opens up on skipper's viral outburst, says 'my father didn’t speak...'", "link": "https://www.moneycontrol.com/sports/cricket/ipl/shreyas-iyer-has-an-attitude-shashank-singh-opens-up-on-skipper-s-viral-outburst-says-my-father-didn-t-speak-article-13104296.html", "date": null, "description": "Shashank Singh finished the season as the second-highest run-scorer from the Punjab Kings camp, accumulating 341 runs at a strike rate of 153.", "source": "Money Control"},
{"title": "Los Angeles immigration protests: FBI Director Kash Patel warns protesters against hitting cops", "link": "https://www.moneycontrol.com/world/los-angeles-immigration-protests-fbi-director-kash-patel-warns-protesters-against-hitting-cops-article-13104295.html", "date": null, "description": "President Donald Trump signed a Presidential Memorandum deploying 2,000 National Guardsmen to Paramount, a city in Los Angeles County, after the protests on Friday.", "source": "Money Control"},
{"title": "Security breach alert: India government issues important warning for Chrome users you; check if you are affected and tips to fix it", "link": "https://www.moneycontrol.com/technology/security-breach-alert-india-government-issues-important-warning-for-chrome-users-you-check-if-you-are-affected-and-tips-to-fix-it-article-13104274.html", "date": null, "description": "India’s cybersecurity agency CERT-In has warned Google Chrome users about high-risk vulnerabilities. Users are urged to update Chrome immediately to avoid potential code execution or system disruption.", "source": "Money Control"},
{"title": "Rhodes scholarship for studying at University of Oxford to be available to more Indians from 2028", "link": "https://www.moneycontrol.com/news/india/rhodes-scholarship-for-studying-at-university-of-oxford-to-be-available-to-more-indians-from-2028-13104292.html", "date": null, "description": "Administered by the Rhodes Trust in Oxford, the programme awards 106 fully funded scholarships to students from anywhere in the world with proven academic excellence", "source": "Money Control"},
{"title": "Bhabiji Ghar Par Hain actor Rohitashv Gour tries Gen Z slang in hilarious video, watch here", "link": "https://www.moneycontrol.com/entertainment/bhabiji-ghar-par-hain-actor-rohitashv-gour-tries-gen-z-slang-in-hilarious-video-watch-here-article-13104287.html", "date": null, "description": "Rohitashv Gour is known for his role in the iconic sitcoms Bhabiji Ghar Par Hain! and Lapataganj. He recently shared a hilarious video trying out some Gen Z slang in front of his daughters.", "source": "Money Control"},
{"title": "RCB's IPL victory and the shadow of number 4: A numerologist’s insight into what went wrong", "link": "https://www.moneycontrol.com/astrology/rcb-s-ipl-victory-and-the-shadow-of-number-4-a-numerologist-s-insight-into-what-went-wrong-article-13104289.html", "date": null, "description": "Discover how numerology explains RCB’s IPL 2025 win and the chaos at their victory parade, decoded through the shadowy influence of Number 4 and Rahu.", "source": "Money Control"},
{"title": "Meta in talks for Scale AI investment that could top $10 billion", "link": "https://www.moneycontrol.com/news/business/meta-in-talks-for-scale-ai-investment-that-could-top-10-billion-13104288.html", "date": null, "description": "The terms of the deal are not finalized and could still change, according to the people, who asked not to be identified discussing private information.", "source": "Money Control"},
{"title": "Canadian journalist Mocha Bezirgan alleges assault by Khalistanis in Vancouver", "link": "https://www.moneycontrol.com/world/canadian-journalist-alleges-assault-by-pro-khalistan-activists-in-vancouver-article-13104275.html", "date": null, "description": "Canadian journalist Mocha Bezirgan alleges he was assaulted by pro-Khalistan activists in Vancouver while reporting, sharing video proof and calling it an attempt to silence independent journalism.", "source": "Money Control"},
{"title": "Loki actor Tom Hiddleston and Zawe Ashton are expecting their second child, latter flaunts baby bump at an event", "link": "https://www.moneycontrol.com/entertainment/loki-actor-tom-hiddleston-and-zawe-ashton-are-expecting-their-second-child-latter-flaunts-baby-bump-at-an-event-article-13104243.html", "date": null, "description": "Broadway actress Zawe Ashton and Marvel’s Tom Hiddleston are expecting their second child, joyfully expanding their family.", "source": "Money Control"},
{"title": "Active Covid-19 cases in India breach 6,000 mark, deaths climb to 65", "link": "https://www.moneycontrol.com/news/india/active-covid-19-cases-in-india-breach-6000-mark-deaths-climb-to-65-13104273.html", "date": null, "description": "Reports have attributed the rise in cases to the new JN.1 variant. Meanwhile the NB.1.8.1 and LF.7 mutations are also known to be major contributors, even though they result in mild symptoms.", "source": "Money Control"},
{"title": "Coffee rave: All about latest trend as Bengaluru, Mumbai catch up with craze", "link": "https://www.moneycontrol.com/news/trends/coffee-rave-all-about-latest-trend-as-bengaluru-mumbai-catch-up-with-craze-13104266.html", "date": null, "description": "Coffee raves started as underground gigs in European bakeries and cafés — think Amsterdam and London — and later hit New York. Now, India’s urban spaces like Mumbai, Bengaluru, Surat, Hyderabad and Indore are joining the wave, inviting people to groove to electronic beats while sipping speciality coffee.", "source": "Money Control"},
{"title": "'None for 11 years': Congress accuses PM Modi of scripting his media interactions, says he 'lacks courage to have undoctored press meet'", "link": "https://www.moneycontrol.com/news/india/none-for-11-years-congress-accuses-pm-modi-of-scripting-his-media-interactions-says-he-lacks-courage-to-have-undoctored-press-meets-13104247.html", "date": null, "description": "", "source": "Money Control"},
{"title": "Akshay Kumar disguises in a mask to get honest review of Housefull 5 outside Bandra theatre, watch video", "link": "https://www.moneycontrol.com/entertainment/akshay-kumar-disguises-in-a-mask-to-get-honest-review-of-housefull-5-outside-bandra-theatre-watch-video-article-13104267.html", "date": null, "description": "Akshay Kumar wore a villain mask and approached excited moviegoers as they exited the theatre in Bandra to capture their reactions on Housefull 5. He was also most caught by his fans.", "source": "Money Control"},
{"title": "Bihar ITI Admit Card 2025 released @ bceceboard.bihar.gov.in, direct link here", "link": "https://www.moneycontrol.com/education/bihar-iti-admit-card-2025-released-bceceboard-bihar-gov-in-direct-link-here-article-13104270.html", "date": null, "description": "Bihar ITI Admit Card 2025 released! Download your BCECEB ITICAT hall ticket now from bceceboard.bihar.gov.in. Exam on 15th June. Check steps & direct link here.", "source": "Money Control"},
{"title": "‘Women are afraid’: Dhaka University professor calls women’s condition in Bangladesh ‘pathetic’", "link": "https://www.moneycontrol.com/world/women-are-afraid-dhaka-university-professor-calls-women-s-condition-in-bangladesh-pathetic-article-13104244.html", "date": null, "description": "Zobaida Nasreen warns of rising threats and social intimidation against women in Bangladesh, calling the situation \"pathetic\" amid a backlash against last year’s protest gains.", "source": "Money Control"},
{"title": "Newlyweds Mahua Moitra and Pinaki Misra's first dance to 'Raat Ke Humsafar' goes viral | WATCH", "link": "https://www.moneycontrol.com/news/india/newlyweds-mahua-moitra-and-pinaki-misra-s-first-dance-to-raat-ke-humsafar-goes-viral-watch-13104261.html", "date": null, "description": "On June 5, Mahua Moitra officially announced the wedding via her X account", "source": "Money Control"},
{"title": "DCP flagged crowd risk in letter, Karnataka govt proceeded with RCB event: Report", "link": "https://www.moneycontrol.com/news/india/dcp-flagged-crowd-risk-in-letter-karnataka-govt-proceeded-with-rcb-event-report-13104264.html", "date": null, "description": "Deputy Commissioner of Police (DCP) MN Karibasvanna had flagged major security risks in a letter dated June 4 to G Satyavathi, head of the Department of Personnel and Administrative Reforms (DPAR).", "source": "Money Control"},
{"title": "‘When you can’t convince people…’: Devendra Fadnavis gives ‘article for an article’ reply after Rahul Gandhi’s ‘match fixing’ allegations", "link": "https://www.moneycontrol.com/news/india/when-you-can-t-convince-people-devendra-fadnavis-gives-article-for-an-article-reply-after-rahul-gandhi-s-match-fixing-allegations-13104258.html", "date": null, "description": "Gandhi, in his op-ed piece in The Indian Express, had questioned the way the Maharashtra Assembly Elections were conducted. Fadnavis' reply came in a Marathi daily on Sunday.", "source": "Money Control"},
{"title": "Shazahn Padamsee and Ashish Kanakia look ethereal in first public appearance after wedding, watch", "link": "https://www.moneycontrol.com/entertainment/shazahn-padamsee-and-ashish-kanakia-look-ethereal-in-first-public-appearance-after-wedding-watch-article-13104245.html", "date": null, "description": "Housefull 2 actress Shazahn Padamsee married longtime beau Ashish Kanakia on June 5, 2025. The couple made a glowing first public appearance as newlyweds on June 7.", "source": "Money Control"},
{"title": "After Piyush Chawla's retirement, only 1 player remains active from 2011 World Cup squad; who's he, where are others", "link": "https://www.moneycontrol.com/sports/cricket/after-piyush-chawla-s-retirement-only-1-player-remains-active-from-2011-world-cup-squad-who-s-he-where-are-others-article-13104260.html", "date": null, "description": "In this article, we take a look at the 15-member squad, who's the only one active from it, and where are they others...", "source": "Money Control"},
{"title": "FPIs turn net sellers; withdraw Rs 8,749 crore from equities in June", "link": "https://www.moneycontrol.com/news/business/markets/fpis-turn-net-sellers-withdraw-rs-8-749-crore-from-equities-in-june-13104257.html", "date": null, "description": "This momentum follows a net investment of Rs 19,860 crore in May and Rs 4,223 crore in April, data with the depositories showed.", "source": "Money Control"},
{"title": "Ex J&K Governor says he's in ICU in critical condition; blames BJP and wants to 'tell the truth to the nation'", "link": "https://www.moneycontrol.com/news/india/ex-j-k-governor-says-he-s-in-icu-in-critical-condition-blames-bjp-and-wants-to-tell-the-truth-to-the-nation-13104235.html", "date": null, "description": "He also said that he had told Prime Minister Narendra Modi himself that there was corruption in the said case and claimed that the tender was passed with someone else's signature after Malik was transferred.", "source": "Money Control"},
{"title": "Mumbai founder encourages employees to have side hustles: 'If my team isn't growing...'", "link": "https://www.moneycontrol.com/news/trends/mumbai-founder-encourages-employees-to-have-side-hustles-if-my-team-isn-t-growing-13104227.html", "date": null, "description": "'At both my companies, we have team members who freelance on the side,' Vedika Bhaia said.", "source": "Money Control"}
]